//
//  SoundList.swift
//  partTest
//
//  Created by 주환 on 2023/03/29.
//

import Foundation


var MusicList1: [String] = [
    /* 여기다가 말하는 캐릭터 이름 써주세요 */
    /* lines의 배열 요소 개수와 캐릭터 배열 요소 개수는 동일해야 함 */
    "0.죽어라 닝겐",
    "1.크아악",
    "nosound",
    "3.엇- 여긴- 어디지--",
    "4.앗- 이세계에 다른 용사가 떨어졌다- 당신의 이름은-",
    "5.안녕하세요-- 제 이름은-- 썹 입니다-- 저 말고도 다른 분들이 계셨다니-- 이곳은 도대체 어디인가요-",
    "nosound",
    "nosound",
    "nosound",
    "9.우리는 곧바로 MC1 던전으로 들어갔다- 던전 안은 어둡고 조용했으나- 우리는 옆에 있는 우리를 믿고 더욱 깊게 걸어갈 수 있었다--제목없음",
    "10.던전에서의 첫째날- 우리는 던전의 주제인 -이세계-아카데미- 라이프-를 해결하기 위해 다같이 협력했다-",
    "11.앗- 두 갈림길이다-",
    "12.흠흠- 저희 지금까지 질문만 했는데- 이번엔 솔루션의 길로 가볼까요-",
    "13.오- 좋은데요- 바로 가시죠-",
    "14.길을 걷는 내내 우리는 위화감에 휩싸였고 우리가 솔루션을 내기에 준비되지 않은 상태였다는 것을 깨달았다--",
    "15.그 순간--",
    "nosound",
    "17.우리는 길을 되돌아오며 무엇이 이세계 라이프에 필요한지- 우리가 진정으로 던져야 할 질문은 무엇이고 목적이 무엇인지 다시 정리할 수 있었다--",
    "18.질문의 길은 사실 질문 지옥이었다"
]



var MusicList2: [String] = [
    /* 여기다가 말하는 캐릭터 이름 써주세요 */
    /* lines의 배열 요소 개수와 캐릭터 배열 요소 개수는 동일해야 함 */
    "전투1.앗 - 질문 지옥을 지배하는 챌린지 몬스터가 등장했다-",
    "전투2.챌린지 몬스터가 과제 공격을 했다-",
    "전투3.우리는 토론하기를 시전했다- -그럼 이세계 라이프에서만 가져갈 수 있는 것은 뭘까요---",
    "전투4.효과는 굉장했다-",
    "전투5.챌린지 몬스터는 다시 한 번 과제 공격을 했다-",
    "전투6.두잇투임 팀은 서로의 의견에 -귀엽게- 반박했다- 이미 존재하는 이세계 라이프 질문 채널의 한계는 무엇이고 왜 쓰는 걸까요--",
    "전투7.효과는 굉장했다- 복사본",
    "전투8.챌린지 몬스터는 기절한 상태다-",
    "전투9.두잇투잇 팀은 최후의 일격을 날렸다- 거리낌 없이 물어보자-",
    "전투10.와- 챌린지 몬스터를 해치웠다-"
]

var MusicList3: [String] = [
    /* 여기다가 말하는 캐릭터 이름 써주세요 */
    /* lines의 배열 요소 개수와 캐릭터 배열 요소 개수는 동일해야 함 */
    "섭0.몬스터를 해치우자- 설문지 보스가 등장했다-",
    "섭1.크하하- 챌린지를 이루고 싶다면 나를 감당해야 할 것이다--",
    "섭2-1.우리는 설문지 항목을 작성하고 다른 이세계 주민들에게 도움을 요청했다-",
    "섭2.설문지를 내고 우리는 챌린지를 구체화할 수 있을 것이라 생각했지만- ",
    "섭3.설문지 보스는 별안간 체력을 회복하며 -솔루션 보스-가 되어버리고 말았다-",
    "섭4.다행히 우리는 설문지 보스를 해치우고 5개의 무기를 얻을 수 있었다-",
    "섭5.그중- 솔루션 보스를 공략할 수 있는 무기인 -랜덤만남 피스톨-로 약점을 겨누었다-",
    "섭6.그 순간-- 복사본",
    "섭7.앗- 솔루션 보스의 하수인- 굳건이가 나타났다-",
    "섭8.하하- 구피와 제리를 예비군으로 잡아가겠다-",
    "섭9.하하- 다시 돌려주겠다-",
    "섭10.우리는 잃었던 구피와 제리를 돌려받고- 솔루션 보스의 머리를?겨누고 있던 방아쇠를 당겼다-",
    "섭11.솔루션 보스는 처참하게 쓰러졌다-",
    "섭12.우리는 성공적으로 MC1의 솔루션 보스를 해치울 수 있었고- 이 소문은 빠르게 퍼져나갔다-",
    "섭12-1-드디어- 이 던전의 끝이 보이고 있어요-- 다들 조금만 더-- ",
    "섭13-1.응 아니야",
    "섭13알고보니 우리는 고작 MC1을 끝냈을 뿐이었다-- ",
    "섭14이세계의 모든 용사들도 이러한 과정을 겪고 있는 걸까-- 모두들- 잘 이겨내기를 바란다- ",
    "nosound"
]


